# Membagi data frame menjadi dua secara acak

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

In [2]:
n_rows = 10 
n_cols = 5 
cols = tuple ('ABCDE')
df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)
df

    A   B   C   D   E
0   1   9  15   9   5
1  10   9  10   5  14
2   6   7   5   5   2
3  17   1  16  19  19
4  10  15   8  15  17
5  19  12   4   2  16
6   6  13   7  11  10
7  17  15   5  10   9
8  14   5   6   4   4
9   4  14   7  16  19

# Membagi data frame menjadi dua secara acak berdasarkan proporsi tertentu

In [3]:
df.shape

(10, 5)

In [4]:
proporsi = 0.7 #proporsi 70% untuk data frame pertama, 30% untuk data frame kedua
df_1 = df.sample(frac=proporsi) #df.sample akan mengambil baris secara acak berjumlah 70% dan hasilnya akan dibentuk di data frame baru yg akan ditampung di df_1
df_2 = df.drop(df_1.index) #menghapus berdasarkan data frame yang sudah diadopsi di df_1

print(f'df_1 shape : {df_1.shape}')
print(f'df_2 shape : {df_1.shape}')

df_1 shape : (7, 5)
df_2 shape : (7, 5)

In [5]:
df_1

    A   B   C   D   E
1  10   9  10   5  14
2   6   7   5   5   2
8  14   5   6   4   4
0   1   9  15   9   5
3  17   1  16  19  19
5  19  12   4   2  16
7  17  15   5  10   9

In [6]:
df_2

    A   B  C   D   E
4  10  15  8  15  17
6   6  13  7  11  10
9   4  14  7  16  19